export const SubCategoriesData = {
  subCategories: [
    {
      id: 1,
      subCategoryElements: [
        {
          id: 1,
          data: [
            "أبو أمامة الباهلي",
            "أبو برزة الأسلمي",
            "أبو بكرة الثقفي",
            "أبو موسى الأشعري",
            "زينب بنت أبي سلمة",
            "عبد الرحمن بن أبزي",
            "عبد الله بن الزبير",
            "عبد الله بن عباس",
            "عبد الله بن عمر بن الخطاب",
            "عبد الله بن مسعود",
            "عمران بن حصين",
            "فقه إسلامي",
            "فقهاء الصحابة",
            "قالب:فقهاء الصحابة",
            "معاذ بن جبل"
          ]
        },
        {
          id: 2,
          data: [
            "أبان بن عثمان بن عفان",
            "أبو بكر بن عبد الرحمن بن الحارث بن هشام",
            "أبو سلمة بن عبد الرحمن بن عوف",
            "الفقهاء السبعة",
            "القاسم بن محمد بن أبي بكر",
            "خارجة بن زيد بن ثابت",
            "سالم بن عبد الله بن عمر بن الخطاب",
            "سعيد بن المسيب",
            "سليمان بن يسار",
            "عبد الله بن نافع الصائغ",
            "عبيد الله بن عبد الله بن عتبة",
            "عروة بن الزبير",
            "كثير بن فرقد المدني",
            "محمد بن الحنفية"
          ]
        },
        {
          id: 3,
          data: [
            "أبو بكر الصديق",
            "أبو موسى الأشعري",
            "الضحاك بن مزاحم",
            "سعيد بن المسيب",
            "عبد الله بن عباس",
            "عبد الله بن عمر بن الخطاب",
            "عبد الله بن عمرو بن العاص",
            "عبد الله بن مسعود",
            "عكرمة البربري",
            "علي بن أبي طالب",
            "محمد بن كعب القرظي"
          ]
        }
      ]
    },
    {
      id: 2,
      subCategoryElements: [
        {
          id: 1,
          data: [
            "أبان بن عثمان بن عفان",
            "أبو بكر بن عبد الرحمن بن الحارث بن هشام",
            "أبو سلمة بن عبد الرحمن بن عوف",
            "الفقهاء السبعة",
            "القاسم بن محمد بن أبي بكر",
            "خارجة بن زيد بن ثابت",
            "سالم بن عبد الله بن عمر بن الخطاب",
            "سعيد بن المسيب",
            "سليمان بن يسار",
            "عبد الله بن نافع الصائغ",
            "عبيد الله بن عبد الله بن عتبة",
            "عروة بن الزبير",
            "كثير بن فرقد المدني",
            "محمد بن الحنفية"
          ]
        },
        {
          id: 2,
          data: [
            "أبو حنيفة النعمان",
            "إسحاق بن راهويه",
            "الربيع بن أنس",
            "السدي",
            "سفيان الثوري",
            "عبد الرزاق الصنعاني",
            "عبد الله بن المبارك",
            "عبد الله بن وهب",
            "عطاء الخراساني",
            "مجاهد بن جبر",
            "مقاتل بن سليمان",
            "يحيى بن سلام"
          ]
        }
      ]
    },
    {
      id: 3,
      subCategoryElements: [
        {
          id: 1,
          data: [
            "أبو أحمد الجلودي",
            "أبو بكر الأصم",
            "أبو علي الجبائي",
            "أبو محمد بن قتيبة الدينوري",
            "أبو مسلم الأصفهاني",
            "أبو منصور الماتريدي",
            "إسحاق بن راهويه",
            "ابن أبي حاتم",
            "ابن المنذر النيسابوري",
            "ابن خزيمة",
            "ابن دريد",
            "عبد الملك بن حبيب السلمي",
            "محمد بن جرير الطبري",
            "محمود حمزة"
          ]
        }
      ]
    },
    {
      id: 4,
      subCategoryElements: [
        {
          id: 1,
          data: ["ابن عبد البر"]
        },
        {
          id: 2,
          data: [
            "أبو أحمد الجلودي",
            "أبو إسحاق الثعلبي",
            "أبو الحسن الرماني",
            "أبو الليث السمرقندي",
            "أبو بكر السجستاني",
            "أبو سهل الصعلوكي",
            "أبو مسلم الأصفهاني",
            "أبو منصور الماتريدي",
            "ابن أبي زمنين",
            "ابن حسنون",
            "ابن خالويه",
            "ابن خزيمة",
            "ابن دريد",
            "ابن فطيس",
            "ابن فورك",
            "ابن ناقيا البغدادي",
            "محمد بن جرير الطبري",
            "مكي بن أبي طالب"
          ]
        }
      ]
    },
    {
      id: 5,
      subCategoryElements: [
        {
          id: 1,
          data: ["ابن عبد البر"]
        },
        {
          id: 2,
          data: [
            "أبو إسحاق الثعلبي",
            "أبو الحسن الحوفي",
            "أبو العباس أحمد بن عمار المهدوي",
            "أبو القاسم الأنصاري",
            "أبو المظفر الإسفراييني",
            "إسماعيل الأصبهاني",
            "إلكيا الهراسي",
            "ابن أبي الطيب",
            "ابن مهريزد",
            "البغوي",
            "الواحدي النيسابوري",
            "محمود بن حمزة الكرماني",
            "ياسمينة السيراوندية"
          ]
        }
      ]
    },
    {
      id: 6,
      subCategoryElements: [
        {
          id: 1,
          data: ["ابن رشد"]
        },
        {
          id: 2,
          data: [
            "أبو القاسم الأنصاري",
            "أبو زكريا التكريتي",
            "أبو موسى المديني",
            "إسماعيل الأصبهاني",
            "ابن الجوزي",
            "ابن دهاق",
            "ابن عطية الأندلسي",
            "عبد الحق الإشبيلي",
            "عبد الرحمن بن علي الحلواني",
            "فخر الدين الأزجي",
            "محمد بن الحسين الزاغولي",
            "محمد بن عبد الواحد الملاحي",
            "محمود بن حمزة الكرماني",
            "يحيى بن سعدون"
          ]
        }
      ]
    },
    {
      id: 7,
      subCategoryElements: [
        {
          id: 1,
          data: ["ابن سيد الناس"]
        },
        {
          id: 2,
          data: ["محمد الوغليسي", "منصور المشدالي"]
        },
        {
          id: 3,
          data: [
            "أبو حيان الغرناطي",
            "أبو زكريا التكريتي",
            "أحمد بن خليل الخويي",
            "ابن القوبع",
            "ابن بزيزة",
            "ابن بنت العراقي",
            "ابن جميل الربعي",
            "ابن دهاق",
            "ابن رشيد السبتي",
            "شمس الدين القرطبي",
            "صدر الدين الشعيبي",
            "عبد الرحمن العبدلياني",
            "عبد الله بن عمر البيضاوي",
            "علي بن عبد الله التبريزي",
            "فخر الدين الأزجي",
            "فخر الدين بن تيمية",
            "محمد بن أحمد الخويي",
            "محمد بن عبد الواحد الملاحي",
            "محمود بن أحمد الزنجاني",
            "محمود بن عبد الرحمن الأصفهاني",
            "منصور المشدالي"
          ]
        }
      ]
    },
    {
      id: 8,
      subCategoryElements: [
        {
          id: 1,
          data: ["ابن سيد الناس"]
        },
        {
          id: 2,
          data: ["إبراهيم بن موسى الشاطبي"]
        },
        {
          id: 3,
          data: [
            "أحمد الغبريني",
            "أحمد بن إدريس الإيلولي",
            "عبد الرحمن الوغليسي",
            "محمد المليكشي",
            "منصور المشدالي"
          ]
        },
        {
          id: 4,
          data: [
            "ابن هشام الأنصاري",
            "أبو بكر الحداد",
            "ابن السكاك المكناسي",
            "ابن القوبع",
            "ابن بنت العراقي",
            "ابن بنت الميلق",
            "ابن جزي الكلبي",
            "ابن رشيد السبتي",
            "ابن عقيل",
            "ابن قيم الجوزية",
            "ابن كثير الدمشقي",
            "ابن مرزوق الحفيد",
            "الفاضل اليمني",
            "شمس الدين ابن الموصلي",
            "شمس الدين محمد بن مفلح",
            "صدر الدين الشعيبي",
            "علي بن أحمد المهائمي",
            "علي بن عبد الله التبريزي",
            "قطب الدين الرازي",
            "محمد المليكشي",
            "محمد بن سعيد الرعيني",
            "محمود بن عبد الرحمن الأصفهاني",
            "منصور المشدالي"
          ]
        }
      ]
    },
    {
      id: 9,
      subCategoryElements: [
        {
          id: 1,
          data: ["سيدي بوسحاقي", "علي آيت منقلات", "منصور آيت منقلات"]
        },
        {
          id: 2,
          data: [
            "أبو الحسن البكري",
            "إلياس السينوبي",
            "ابن أمير حاج",
            "ابن إمام الكاملية",
            "ابن السكاك المكناسي",
            "ابن العيني",
            "ابن بنت الأقصرائي",
            "ابن خطيب الناصرية",
            "ابن عادل الحنبلي",
            "ابن مرزوق الحفيد",
            "برهان الدين البقاعي",
            "سيدي بوسحاقي",
            "شمس الدين محمد بن مفلح",
            "علاء الدين الشيرازي",
            "علي بن أحمد المهائمي",
            "محيي الدين الكافيجي",
            "مصنفك",
            "نظام الدين النيسابوري"
          ]
        }
      ]
    },
    {
      id: 10,
      subCategoryElements: [
        {
          id: 1,
          data: [
            "أبو الحسن الأشعري",
            "أبو السعود أفندي",
            "بدر الدين الكرخي",
            "محب الدين الحموي",
            "محمد بن عبد الرحمن العلقمي",
            "محمد عرب زاده",
            "مصلح الدين السروري"
          ]
        }
      ]
    },
    {
      id: 11,
      subCategoryElements: [
        {
          id: 1,
          data: [
            "ابن علان",
            "صالح بن مهدي المقبلي",
            "عبد الرحمن بن عيسى المرشدي",
            "عبد المجيد السيواسي",
            "فرج الله الحويزي",
            "قطب الدين الصفوي",
            "محب الدين الحموي",
            "محمد بن رسول الحسيني البرزنجي",
            "ملا جيون"
          ]
        }
      ]
    },
    {
      id: 12,
      subCategoryElements: [
        {
          id: 1,
          data: [
            "ابن الست",
            "صالح بن مهدي المقبلي",
            "عبد الله بن محمد بن عبد الوهاب",
            "محمد بن يوسف الإسبيري",
            "محمد زيني البغدادي",
            "ملا جيون"
          ]
        }
      ]
    },
    {
      id: 13,
      subCategoryElements: [
        {
          id: 1,
          data: [
            "أبو الثناء الآلوسي",
            "أحمد بن عجيبة",
            "عبد الحكيم الأفغاني",
            "عبد الرحمن القره داغي",
            "عبد الله العلمي",
            "عبد الله بن محمد بن عبد الوهاب",
            "عبد الله شبر",
            "محمد الشوكاني",
            "محمد بن إبراهيم الحسيني",
            "محمد بن يوسف أطفيش",
            "محمد زيني البغدادي",
            "محمد سليم العطار",
            "محمد كامل الطرابلسي",
            "مهر علي شاه"
          ]
        }
      ]
    },
    {
      id: 14,
      subCategoryElements: [
        {
          id: 1,
          data: [
            "أبو الأعلى المودودي",
            "أبو بكر الجزائري",
            "أحمد اللدن",
            "أحمد بن مصطفى العلاوي",
            "أحمد بن مصطفى المراغي",
            "أمين أحسن إصلاحي",
            "ابن عقيل الظاهري",
            "سيد قطب",
            "عبد الحسين الرشتي",
            "عبد الحكيم الأفغاني",
            "عبد الرحمن القره داغي",
            "عبد الرحمن بن ناصر السعدي",
            "عبد الله العلمي",
            "عبد الملك كريم أمر الله",
            "عمر راسم",
            "محمد الأمين الشنقيطي",
            "محمد الطاهر بن عاشور",
            "محمد بن أحمد السوسي",
            "محمد بن إبراهيم الحسيني",
            "محمد بن يوسف أطفيش",
            "محمد رشيد رضا",
            "محمد سليم العطار",
            "محمد كامل الطرابلسي",
            "محمد متولي الشعراوي",
            "محمود حمزة",
            "ناصر مكارم الشيرازي",
            "يعسوب الدين رستكار الجويباري"
          ]
        }
      ]
    },
    {
      id: 15,
      subCategoryElements: [
        {
          id: 1,
          data: [
            "أبو بكر الجزائري",
            "أحمد اللدن",
            "ابن عقيل الظاهري",
            "محمد علي الصابوني",
            "ناصر مكارم الشيرازي",
            "يعسوب الدين رستكار الجويباري"
          ]
        }
      ]
    }
  ]
};
